cavity-box/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

dy0     0;
dy1     5;
dy2     8;

dz1      0;
dz2      -6;
dz3      6;
dz4      12;

dx1      0;
dx2      6;
dx3      9;
dx4      12;



vertices
(
    //vertices da face esquerda externa
    ($dx1 $dy0 $dz2) // 0
    ($dx2 $dy0 $dz2) // 1
    ($dx3 $dy0 $dz2) // 2
    ($dx4 $dy0 $dz2) // 3
    
    ($dx4 $dy1 $dz2) // 4
    ($dx3 $dy1 $dz2) // 5
    ($dx2 $dy1 $dz2) // 6
    ($dx1 $dy1 $dz2)// 7

    ($dx4 $dy2 $dz2)  //8
    ($dx3 $dy2 $dz2) // 9
    ($dx2 $dy2 $dz2) // 10
    ($dx1 $dy2 $dz2) // 11

//vertices da face esquerda interna
     ($dx1 $dy0 $dz1)//  12
     ($dx2 $dy0 $dz1) // 13
     ($dx3 $dy0 $dz1) // 14
     ($dx4 $dy0 $dz1) // 15
    
     ($dx4 $dy1 $dz1) // 16
     ($dx3 $dy1 $dz1) // 17
     ($dx2 $dy1 $dz1) // 18
     ($dx1 $dy1 $dz1) // 19
    
     ($dx4 $dy2 $dz1)// 20
     ($dx3 $dy2 $dz1) // 21
     ($dx2 $dy2 $dz1) // 22
     ($dx1 $dy2 $dz1) // 23

//vertices da face do meio 
     ($dx1 $dy0 $dz3)//  24
     ($dx2 $dy0 $dz3) // 25
     ($dx3 $dy0 $dz3) // 26
     ($dx4 $dy0 $dz3) // 27

     ($dx4 $dy1 $dz3) // 28
     ($dx3 $dy1 $dz3) // 29
     ($dx2 $dy1 $dz3) // 30
     ($dx1 $dy1 $dz3) // 31

     ($dx4 $dy2 $dz3)// 32
     ($dx3 $dy2 $dz3) // 33
     ($dx2 $dy2 $dz3) // 34
     ($dx1 $dy2 $dz3) // 35


     //vertices da face do meio 
     ($dx1 $dy0 $dz4)//  36
     ($dx2 $dy0 $dz4) // 37
     ($dx3 $dy0 $dz4) // 38
     ($dx4 $dy0 $dz4) // 39

     ($dx4 $dy1 $dz4) // 40
     ($dx3 $dy1 $dz4) // 41
     ($dx2 $dy1 $dz4) // 42
     ($dx1 $dy1 $dz4) // 43

     ($dx4 $dy2 $dz4)//  44
     ($dx3 $dy2 $dz4) // 45
     ($dx2 $dy2 $dz4) // 46
     ($dx1 $dy2 $dz4) // 47
      
);

blocks
(
   //left
    hex (0 1 6 7 12 13 18 19)     (10 10 10)     simpleGrading (1 1 1)
    hex (7 6 10 11 19 18 22 23)   (10 10 10)   simpleGrading (1 1 1)
    hex (12 13 18 19 24 25 30 31) (10 10 10) simpleGrading (1 1 1)
    hex (19 18 22 23 31 30 34 35) (10 10 10) simpleGrading (1 1 1)
    hex (24 25 30 31 36 37 42 43) (10 10 10) simpleGrading (1 1 1)
    hex (31 30 34 35 43 42 46 47) (10 10 10) simpleGrading (1 1 1)
    
    //center
    hex (1 2 5 6 13 14 17 18) (10 10 10) simpleGrading (1 1 1)
    hex (6 5 9 10 18 17 21 22) (10 10 10) simpleGrading (1 1 1)
    hex (18 17 21 22 30 29 33 34) (10 10 10) simpleGrading (1 1 1)
    hex (25 26 29 30 37 38 41 42) (10 10 10) simpleGrading (1 1 1)
    hex (30 29 33 34 42 41 45 46) (10 10 10) simpleGrading (1 1 1)



    //right
    hex (2 3 4 5 14 15 16 17) (10 10 10) simpleGrading (1 1 1)
    hex (5 4 8 9 17 16 20 21) (10 10 10) simpleGrading (1 1 1)
    hex (14 15 16 17 26 27 28 29) (10 10 10) simpleGrading (1 1 1)
    hex (17 16 20 21 29 28 32 33) (10 10 10) simpleGrading (1 1 1)
    hex (26 27 28 29 38 39 40 41) (10 10 10) simpleGrading (1 1 1)
    hex (29 28 32 33 41 40 44 45) (10 10 10) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet //entrada
    {
        type patch;
        faces
        (
            (0 7 19 12)
            (12 19 31 24)
            (24 31 43 36)
            (7 11 23 19)
            (19 23 35 31)
            (31 35 47 43)
            
            //

           

        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 4 16 15)
            (4 8 20 16)
            (15 16 28 27)
            (16 20 32 28)
            (27 28 40 39)
            (28 32 44 40)
        

           

        );
     }
    walls
    {
        type wall;
        faces
        (
           //left
            (0 7 6 1)
            (7 11 10 6)
            (1 6 5 2)
            (6 10 9 5)
            (2 5 4 3)
            (5 9 8 4)
            
//
           //right
           //(36 37 42 43)
           //(43 42 46 47)
           //(37 38 41 42)
           //(42 41 45 46)
           //(38 39 40 41)
           //(41 40 44 45)

           (36 43 42 37)
           (43 47 46 42)
           (37 42 41 38)
           (42 46 45 41)
           (38 41 40 39)
           (41 45 44 40)
            
            //

            //bottom
            (0 1 13 12)
            (12 13 25 24)
            (24 25 37 36)
            
            (2 14 15 3)
            (14 26 27 15)
            (26 27 39 38)

            (1 2 14 13)
            //(13 25 26 14)
            (25 26 38 37)


            //block of middle
            (13 18 30 25) //frent
            (25 30 29 26) // frent
            (26 29 17 14) //..
            (14 17 18 13) // left
           (18 17 29 30) //top
            

        );
    }
);

mergePatchPairs
(
);

// ************************* //